<?php

return [
    'email' => 'البريد الإلكتروني',
    'password' => 'كلمة المرور',
    'email_required' => 'البريد الإلكتروني مطلوب.',
    'email_email' => 'يرجى إدخال بريد إلكتروني صالح.',
    'email_exists' => 'البريد الإلكتروني المدخل غير مسجل لدينا.',
    'password_required' => 'كلمة المرور مطلوبة.',
    'password_string' => 'يجب أن تكون كلمة المرور نصاً.',
    'invalid_credentials' => 'بيانات الدخول غير صحيحة.',
    'account_inactive' => 'الحساب غير مفعل من قبل الإدارة.',
    'index' => 'المديرين',
    'create' => 'إنشاء مدير جديد',
    'edit' => 'تعديل بيانات المدير',
    'admins' => 'المديرين',
    'create_admin' => 'إنشاء مدير جديد',
    'edit_admin' => 'تعديل بيانات المدير',
];
