<?php

return [
    'id'            => 'المعرف',
    'title'         => 'الاسم',
    'title_en'      => 'الاسم (إنجليزي)',
    'title_ar'      => 'الاسم (عربي)',
    'is_active'     => 'التفعيل',
    'client_id'     => 'العميل',
    'select_client' => 'اختر العميل',
    'pet_type_id'   => 'نوع الحيوان الأليف',
    'select_type'   => 'اختر نوع الحيوان',
    'name'          => 'الاسم',
    'name_en'       => 'الاسم (إنجليزي)',
    'name_ar'       => 'الاسم (عربي)',
    'breed'         => 'السلالة',
    'breed_en'      => 'السلالة (إنجليزي)',
    'breed_ar'      => 'السلالة (عربي)',
    'date_of_birth' => 'تاريخ الميلاد',
    'weight'        => 'الوزن (كجم)',
    'gender'        => 'الجنس',
    'image'         => 'الصورة',
    'created_at'    => 'التاريخ',
];
