<?php

return [
    'fetched'               => 'تم جلب الحيوانات بنجاح.',
    'type_fetched'          => 'تم جلب أنواع الحيوانات بنجاح.',
    'created'               => 'تم انشاء الحيوان الاليف بنجاح.',
    'updated'               => 'تم التحديث الحيوان بنجاح.',
    'deleted'               => 'تم الحذف بنجاح.',
    'activated'             => 'تم التفعيل بنجاح.',
    'deactivated'           => 'تم إلغاء التفعيل بنجاح.',

    'title_en_required'     => 'حقل الاسم باللغة الإنجليزية مطلوب.',
    'title_en_string'       => 'تنسيق الاسم باللغة الإنجليزية غير صالح.',
    'title_en_max'          => 'يجب ألا يتجاوز الاسم باللغة الإنجليزية 255 حرفاً.',

    'title_ar_required'     => 'حقل الاسم باللغة العربية مطلوب.',
    'title_ar_string'       => 'تنسيق الاسم باللغة العربية غير صالح.',
    'title_ar_max'          => 'يجب ألا يتجاوز الاسم باللغة العربية 255 حرفاً.',

    'is_active_boolean'     => 'قيمة التفعيل غير صالحة.',

    'client_id_required'    => 'حقل العميل مطلوب.',
    'client_id_integer'     => 'اختيار العميل غير صالح.',
    'client_id_exists'      => 'العميل المحدد غير موجود.',

    'pet_type_id_required'  => 'حقل نوع الحيوان الأليف مطلوب.',
    'pet_type_id_integer'   => 'اختيار نوع الحيوان الأليف غير صالح.',
    'pet_type_id_exists'    => 'نوع الحيوان الأليف المحدد غير موجود.',

    'name_required'         => 'حقل الاسم مطلوب.',
    'name_string'           => 'تنسيق الاسم غير صالح.',
    'name_max'              => 'يجب ألا يتجاوز الاسم 255 حرفاً.',

    'name_en_required'      => 'حقل الاسم باللغة الإنجليزية مطلوب.',
    'name_en_string'        => 'تنسيق الاسم باللغة الإنجليزية غير صالح.',
    'name_en_max'           => 'يجب ألا يتجاوز الاسم باللغة الإنجليزية 255 حرفاً.',

    'name_ar_required'      => 'حقل الاسم باللغة العربية مطلوب.',
    'name_ar_string'        => 'تنسيق الاسم باللغة العربية غير صالح.',
    'name_ar_max'           => 'يجب ألا يتجاوز الاسم باللغة العربية 255 حرفاً.',

    'breed_string'          => 'تنسيق السلالة غير صالح.',
    'breed_max'             => 'يجب ألا تتجاوز السلالة 255 حرفاً.',

    'breed_en_string'       => 'تنسيق السلالة باللغة الإنجليزية غير صالح.',
    'breed_en_max'          => 'يجب ألا تتجاوز السلالة باللغة الإنجليزية 255 حرفاً.',

    'breed_ar_string'       => 'تنسيق السلالة باللغة العربية غير صالح.',
    'breed_ar_max'          => 'يجب ألا تتجاوز السلالة باللغة العربية 255 حرفاً.',

    'date_of_birth_date'    => 'تاريخ الميلاد غير صالح.',

    'weight_numeric'        => 'الوزن يجب أن يكون رقماً.',
    'weight_min'            => 'الوزن يجب أن يكون أكبر من 0.',

    'gender_required'       => 'حقل الجنس مطلوب.',
    'gender_string'         => 'تنسيق الجنس غير صالح.',
    'gender_in'             => 'قيمة الجنس غير صالحة.',

    'image_invalid'         => 'يجب أن يكون الملف المرفوع صورة.',
    'image_mimes'           => 'يجب أن تكون الصورة من نوع: jpeg, png, jpg, webp, svg, gif.',
    'image_max'             => 'يجب ألا يتجاوز حجم الصورة 2048 كيلوبايت.',
];
