<?php

return [
    'title_en_required' => 'الاسم بالإنجليزي مطلوب.',
    'title_en_string' => 'الاسم بالإنجليزي يجب أن يكون نصاً.',
    'title_ar_required' => 'الاسم بالعربي مطلوب.',
    'title_ar_string' => 'الاسم بالعربي يجب أن يكون نصاً.',
    'description_en_string' => 'الوصف بالإنجليزي يجب أن يكون نصاً.',
    'description_ar_string' => 'الوصف بالعربي يجب أن يكون نصاً.',
    'address_en_string' => 'العنوان بالإنجليزي يجب أن يكون نصاً.',
    'address_ar_string' => 'العنوان بالعربي يجب أن يكون نصاً.',
    'phone_string' => 'رقم الهاتف يجب أن يكون نصاً.',
    'image_invalid' => 'الملف المرفق يجب أن يكون صورة.',
    'image_mimes' => 'الصورة يجب أن تكون من نوع jpeg, png, jpg, webp, svg, gif.',
    'image_max' => 'حجم الصورة يجب أن لا يتجاوز 2 ميجابايت.',
    'lat_string' => 'خط العرض يجب أن يكون إحداثية صحيحة.',
    'long_string' => 'خط الطول يجب أن يكون إحداثية صحيحة.',
];
