<?php

return [
    'products' => 'المنتجات',
    'index' => 'المنتجات',
    'create' => 'إنشاء منتج جديد',
    'edit' => 'تعديل بيانات المنتج',
    'create_product' => 'إنشاء منتج جديد',
    'edit_product' => 'تعديل بيانات المنتج',
    'main_data' => 'البيانات الأساسية',
    'status' => 'الحالة',
    'actions' => 'الإجراءات',
    'edit' => 'تعديل',
    'delete' => 'حذف',
    'cancel' => 'إلغاء',
    'yes_delete' => 'نعم، احذف',
    'sure_delete' => 'هل أنت متأكد من الحذف؟',
    'cant_revert' => 'لن تتمكن من التراجع عن هذا!',
    'export' => 'تصدير إكسيل',
];
