<?php

return [
    'hashtag' => [
        'index' => 'الهاشتاجات',
        'fetched' => 'تم جلب الهاشتاجات بنجاح',
        'created' => 'تم إنشاء الهاشتاج بنجاح',
        'updated' => 'تم تحديث الهاشتاج بنجاح',
        'deleted' => 'تم حذف الهاشتاج بنجاح',
        'activated' => 'تم تفعيل الهاشتاج بنجاح',
        'deactivated' => 'تم إلغاء تفعيل الهاشتاج بنجاح',
    ],
    'post' => [
        'index' => 'المنشورات',
        'fetched' => 'تم جلب المنشورات بنجاح',
        'created' => 'تم إنشاء المنشور بنجاح',
        'updated' => 'تم تحديث المنشور بنجاح',
        'deleted' => 'تم حذف المنشور بنجاح',
        'activated' => 'تم تفعيل المنشور بنجاح',
        'deactivated' => 'تم إلغاء تفعيل المنشور بنجاح',
    ],
    'comment' => [
        'index' => 'التعليقات',
        'fetched' => 'تم جلب التعليقات بنجاح',
        'created' => 'تم إنشاء التعليق بنجاح',
        'updated' => 'تم تحديث التعليق بنجاح',
        'deleted' => 'تم حذف التعليق بنجاح',
        'activated' => 'تم تفعيل التعليق بنجاح',
        'deactivated' => 'تم إلغاء تفعيل التعليق بنجاح',
    ],
    'like' => [
        'index' => 'الإعجابات',
        'fetched' => 'تم جلب الإعجابات بنجاح',
        'created' => 'تم إنشاء الإعجاب بنجاح',
        'deleted' => 'تم حذف الإعجاب بنجاح',
    ],
    'story' => [
        'index' => 'القصص',
        'fetched' => 'تم جلب القصص بنجاح',
        'created' => 'تم إنشاء القصة بنجاح',
        'updated' => 'تم تحديث القصة بنجاح',
        'deleted' => 'تم حذف القصة بنجاح',
        'activated' => 'تم تفعيل القصة بنجاح',
        'deactivated' => 'تم إلغاء تفعيل القصة بنجاح',
    ],
    'follow' => [
        'index' => 'المتابعات',
        'fetched' => 'تم جلب المتابعات بنجاح',
        'created' => 'تم إنشاء المتابعة بنجاح',
        'deleted' => 'تم حذف المتابعة بنجاح',
    ],
    'block' => [
        'index' => 'الحظر',
        'fetched' => 'تم جلب الحظر بنجاح',
        'created' => 'تم إنشاء الحظر بنجاح',
        'deleted' => 'تم حذف الحظر بنجاح',
    ],
];
