<?php

return [
    'fetched'      => 'تم جلب الكوبونات بنجاح.',
    'created'      => 'تم إنشاء الكوبون بنجاح.',
    'updated'      => 'تم تحديث الكوبون بنجاح.',
    'deleted'      => 'تم حذف الكوبون بنجاح.',
    'ended'        => 'تم استنفاد هذا الكوبون بالكامل.',
    'client_limit' => 'لقد وصلت إلى الحد الأقصى لاستخدام هذا الكوبون.',
    'invalid_date' => 'هذا الكوبون غير صالح في تاريخ اليوم.',
    'invalid_time' => 'هذا الكوبون غير صالح في الوقت الحالي.',
    'not_found'    => 'الكوبون غير موجود أو غير صالح.',
];
